[{"_id":{"$oid":"67b25d5b830275e2a54d7942"},"Title":"Alien","Description":"After investigating a mysterious transmission of unknown origin, the crew of a commercial spacecraft encounters a deadly lifeform. One of the greatest slasher films ever created.","Genre":{"Name":"Science Fiction","Description":"Science fiction (or sci-fi) is a film genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, spacecraft, robots, cyborgs, mutants, interstellar travel, time travel, or other technologies. Science fiction films have often been used to focus on political or social issues, and to explore philosophical issues like the human condition."},"Director":{"Name":"Ridley Scott","Bio":"Sir Ridley Scott is an English film director and producer. He directs films in the science fiction, crime, and historical drama genres, with an atmospheric and highly concentrated visual style.","Birth":"1937"}},{"_id":{"$oid":"67b25f57830275e2a54d7943"},"Title":"Beau is Afraid","Description":"Following the sudden death of his mother, a mild-mannered but anxiety-ridden man confronts his darkest fears as he embarks on an epic odyssey back home.","Genre":{"Name":"Black Comedy","Description":"Black comedy, also known as black humor, bleak comedy, dark comedy, dark humor, gallows humor or morbid humor, is a style of comedy that makes light of subject matter that is generally considered taboo, particularly subjects that are normally considered serious or painful to discuss."},"Director":{"Name":"Ari Aster","Bio":"Ari Aster is an American filmmaker. After garnering initial recognition for the short film The Strange Thing About the Johnsons (2011), he became best known for writing and directing Hereditary (2018), Midsommar (2019), and Beau Is Afraid (2023), all of which were released by A24.","Birth":"1986"}},{"_id":{"$oid":"67b265b7830275e2a54d7945"},"Title":"Scream","Description":"A year after the murder of her mother, a teenage girl is terrorized by a masked killer who targets her and her friends by using scary movies as part of a deadly game.","Genre":{"Name":"Black Comedy","Description":"Black comedy, also known as black humor, bleak comedy, dark comedy, dark humor, gallows humor or morbid humor, is a style of comedy that makes light of subject matter that is generally considered taboo, particularly subjects that are normally considered serious or painful to discuss."},"Director":{"Name":"Wes Craven","Bio":"Wesley Earl Craven was an American film director, screenwriter and producer. Amongst his prolific filmography, Craven worked primarily in the horror genre, particularly slasher films, where he mixed horror cliches with humor.","Birth":"1939","Death":"2015"}},{"_id":{"$oid":"67b2668d830275e2a54d7946"},"Title":"The Shining","Description":"A family heads to an isolated hotel for the winter, where a sinister presence influences the father into violence. At the same time, his psychic son sees horrifying forebodings from both the past and the future.","Genre":{"Name":"Horror","Description":"Horror is a film genre that seeks to elicit physical or psychological fear in its viewers."},"Director":{"Name":"Stanley Kubrick","Bio":"Stanley Kubrick was an American film director, screenwriter, producer, and photographer. Widely considered one of the greatest filmmakers of all time, his films were nearly all adaptations of novels or short stories, spanning a number of genres and gaining recognition for their intense attention to detail, innovative cinematography, extensive set design, and dark humor.","Birth":"1928","Death":"1999"}},{"_id":{"$oid":"67b26775830275e2a54d7947"},"Title":"Castle in the Sky","Description":"Pazu's life changes when he meets Sheeta, a girl whom pirates are chasing for her crystal amulet, which has the potential to locate Laputa, a legendary castle floating in the sky.","Genre":{"Name":"Adventure","Description":"The adventure film is a broad genre of film. Some early genre studies found it no different than the Western film or argued that adventure could encompass all Hollywood genres. Commonality was found among historians Brian Taves and Ian Cameron in that the genre required a setting that was both remote in time and space to the film audience and that it contained a positive hero who tries to make right in their world. Some critics such as Taves limit the genre to naturalistic settings, while Yvonne Tasker found that would limit films such as Raiders of the Lost Ark (1981) from the genre. Tasker found that most films in the genre featured narratives located within a fantasy world of exoticized setting, which are often driven by quests for characters seeking mythical objects or treasure hunting. The genre is closely associated with the action film, and is sometimes used interchangeably or in tandem with that genre."},"Director":{"Name":"Hayao Miyazaki","Bio":"Hayao Miyazaki is a Japanese animator, filmmaker, and manga artist. He co-founded Studio Ghibli and serves as its honorary chairman. Over the course of his career, Miyazaki has attained international acclaim as a masterful storyteller and creator of Japanese animated feature films, and is widely regarded as one of the most accomplished filmmakers in the history of animation.","Birth":"1941"},"Bio":"Hayao Miyazaki is a Japanese animator, filmmaker, and manga artist. He co-founded Studio Ghibli and serves as its honorary chairman. Over the course of his career, Miyazaki has attained international acclaim as a masterful storyteller and creator of Japanese animated feature films, and is widely regarded as one of the most accomplished filmmakers in the history of animation. Born in Tokyo City, Miyazaki expressed interest in manga and animation from an early age. He joined Toei Animation in 1963, working as an inbetween artist and key animator on films like Gulliver's Travels Beyond the Moon (1965), Puss in Boots (1969), and Animal Treasure Island (1971), before moving to A-Pro in 1971, where he co-directed Lupin the Third Part I (1971–1972) alongside Isao Takahata. After moving to Zuiyō Eizō (later Nippon Animation) in 1973, Miyazaki worked as an animator on World Masterpiece Theater and directed the television series Future Boy Conan (1978). He joined Tokyo Movie Shinsha in 1979 to direct his first feature film The Castle of Cagliostro (1979) and the television series Sherlock Hound (1984–1985). He wrote and illustrated the manga Nausicaä of the Valley of the Wind (1982–1994) and directed the 1984 film adaptation produced by Topcraft."},{"_id":{"$oid":"67b26c0c830275e2a54d7948"},"Title":"Princess Mononoke","Description":"On a journey to find the cure for a Tatarigami's curse, Ashitaka finds himself in the middle of a war between the forest gods and Tatara, a mining colony. In this quest he also meets San, the Mononoke Hime. A captivating mix of 2D and 3D animation.","Genre":{"Name":"Adventure","Description":"The adventure film is a broad genre of film. Some early genre studies found it no different than the Western film or argued that adventure could encompass all Hollywood genres. Commonality was found among historians Brian Taves and Ian Cameron in that the genre required a setting that was both remote in time and space to the film audience and that it contained a positive hero who tries to make right in their world. Some critics such as Taves limit the genre to naturalistic settings, while Yvonne Tasker found that would limit films such as Raiders of the Lost Ark (1981) from the genre. Tasker found that most films in the genre featured narratives located within a fantasy world of exoticized setting, which are often driven by quests for characters seeking mythical objects or treasure hunting. The genre is closely associated with the action film, and is sometimes used interchangeably or in tandem with that genre."},"Director":{"Name":"Hayao Miyazaki","Bio":"Hayao Miyazaki is a Japanese animator, filmmaker, and manga artist. He co-founded Studio Ghibli and serves as its honorary chairman. Over the course of his career, Miyazaki has attained international acclaim as a masterful storyteller and creator of Japanese animated feature films, and is widely regarded as one of the most accomplished filmmakers in the history of animation.","Birth":"1941"},"Bio":"Hayao Miyazaki is a Japanese animator, filmmaker, and manga artist. He co-founded Studio Ghibli and serves as its honorary chairman. Over the course of his career, Miyazaki has attained international acclaim as a masterful storyteller and creator of Japanese animated feature films, and is widely regarded as one of the most accomplished filmmakers in the history of animation. Born in Tokyo City, Miyazaki expressed interest in manga and animation from an early age. He joined Toei Animation in 1963, working as an inbetween artist and key animator on films like Gulliver's Travels Beyond the Moon (1965), Puss in Boots (1969), and Animal Treasure Island (1971), before moving to A-Pro in 1971, where he co-directed Lupin the Third Part I (1971–1972) alongside Isao Takahata. After moving to Zuiyō Eizō (later Nippon Animation) in 1973, Miyazaki worked as an animator on World Masterpiece Theater and directed the television series Future Boy Conan (1978). He joined Tokyo Movie Shinsha in 1979 to direct his first feature film The Castle of Cagliostro (1979) and the television series Sherlock Hound (1984–1985). He wrote and illustrated the manga Nausicaä of the Valley of the Wind (1982–1994) and directed the 1984 film adaptation produced by Topcraft."},{"_id":{"$oid":"67b26cbe830275e2a54d7949"},"Title":"Full Metal Jacket","Description":"A pragmatic U.S. Marine observes the dehumanizing effects the Vietnam War has on his fellow recruits from their brutal boot camp training to the bloody street fighting in Hue.","Genre":{"Name":"War","Description":"War film is a film genre concerned with warfare, typically about naval, air, or land battles, with combat scenes central to the drama."},"Director":{"Name":"Stanley Kubrick","Bio":"Stanley Kubrick was an American film director, screenwriter, producer, and photographer. Widely considered one of the greatest filmmakers of all time, his films were nearly all adaptations of novels or short stories, spanning a number of genres and gaining recognition for their intense attention to detail, innovative cinematography, extensive set design, and dark humor.","Birth":"1928","Death":"1999"}},{"_id":{"$oid":"67b26e69830275e2a54d794b"},"Title":"The Lighthouse","Description":"Two lighthouse keepers try to maintain their sanity while living on a remote and mysterious New England island in the 1890s.","Genre":{"Name":"Horror","Description":"Horror is a film genre that seeks to elicit physical or psychological fear in its viewers."},"Director":{"Name":"Robert Eggers","Bio":"Robert Houston Eggers is an American filmmaker. Largely known for writing and directing historical fiction films, his most notable works are the horror films The Witch (2015), The Lighthouse (2019) and Nosferatu (2024) as well as the action film The Northman (2022).","Birth":"1983"}},{"_id":{"$oid":"67b26f7e830275e2a54d794c"},"Title":"Grave of the Fireflies","Description":"A young boy and his little sister struggle to survive in Japan during World War II.","Genre":{"Name":"War","Description":"War film is a film genre concerned with warfare, typically about naval, air, or land battles, with combat scenes central to the drama."},"Director":{"Name":"Isao Takahata","Bio":"Isao Takahata was a Japanese director, screenwriter and producer. A co-founder of Studio Ghibli, he earned international critical acclaim for his work as a director of Japanese animated feature films.","Birth":"1935","Death":"2018"}}]
